//;******************************************************************************
//;* Copyright (c) 2015 - 2022, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
//; 

/=#

#include "Standard.uni"

// Form - Setup Page Panel
#string STR_FORM_SETUP_PAGE_PANEL_TITLE                                              #language en-US  "Setup Page Panel"
#string STR_FORM_SETUP_PAGE_PANEL_HELP                                               #language en-US  "Test the display of Setup Page Panel"

// Test: Single or multi pages
#string STR_FORM_SETUP_PAGE_PANEL_NO_ITEM_PAGE_TITLE                                 #language en-US  "No item page"
#string STR_FORM_SETUP_PAGE_PANEL_NO_ITEM_PAGE_HELP                                  #language en-US  "There is no item in setup page panel."
#string STR_FORM_SETUP_PAGE_PANEL_NO_SELECTABLE_ITEM_IN_ONE_PAGE_TITLE               #language en-US  "No selectable item in 1 page"
#string STR_FORM_SETUP_PAGE_PANEL_NO_SELECTABLE_ITEM_IN_ONE_PAGE_HELP                #language en-US  "There is no selectable item in 1 page of setup page panel."
#string STR_FORM_SETUP_PAGE_PANEL_NO_SELECTABLE_ITEM_IN_THREE_PAGE_TITLE             #language en-US  "No selectable item in 3 page"
#string STR_FORM_SETUP_PAGE_PANEL_NO_SELECTABLE_ITEM_IN_THREE_PAGE_HELP              #language en-US  "There is no selectable item in 3 page of setup page panel."
#string STR_FORM_SETUP_PAGE_PANEL_ONE_SELECTABLE_ITEM_IN_ONE_PAGE_TITLE              #language en-US  "One selectable item in 1/1 page"
#string STR_FORM_SETUP_PAGE_PANEL_ONE_SELECTABLE_ITEM_IN_ONE_PAGE_HELP               #language en-US  "There is one selectable item in 1 page of setup page panel."
#string STR_FORM_SETUP_PAGE_PANEL_ONE_SELECTABLE_ITEM_IN_ONE_THIRD_PAGE_TITLE        #language en-US  "One selectable item in 1/3 page"
#string STR_FORM_SETUP_PAGE_PANEL_ONE_SELECTABLE_ITEM_IN_ONE_THIRD_PAGE_HELP         #language en-US  "There is one selectable item in first page of 3 pages of setup page panel."
#string STR_FORM_SETUP_PAGE_PANEL_ONE_SELECTABLE_ITEM_IN_THREE_THIRD_PAGE_TITLE      #language en-US  "One selectable item in 3/3 page (Subtitle opcode)"
#string STR_FORM_SETUP_PAGE_PANEL_ONE_SELECTABLE_ITEM_IN_THREE_THIRD_PAGE_TITLE_2    #language en-US  "One selectable item in 3/3 page (Text opcode)"
#string STR_FORM_SETUP_PAGE_PANEL_ONE_SELECTABLE_ITEM_IN_THREE_THIRD_PAGE_HELP       #language en-US  "There is one selectable item in thrid page of 3 pages of setup page panel."
#string STR_FORM_SETUP_PAGE_PANEL_TWO_SELECTABLE_ITEM_IN_ONE_PAGE_TITLE              #language en-US  "Two selectable item in 1/1 page"
#string STR_FORM_SETUP_PAGE_PANEL_TWO_SELECTABLE_ITEM_IN_ONE_PAGE_HELP               #language en-US  "There is two selectable items in 1 page of setup page panel."
#string STR_FORM_SETUP_PAGE_PANEL_TWO_SELECTABLE_ITEM_IN_ONE_THIRD_PAGE_TITLE        #language en-US  "Two selectable item in 1/3 page"
#string STR_FORM_SETUP_PAGE_PANEL_TWO_SELECTABLE_ITEM_IN_ONE_THIRD_PAGE_HELP         #language en-US  "There is two selectable item in first page of 3 pages of setup page panel."
#string STR_FORM_SETUP_PAGE_PANEL_TWO_SELECTABLE_ITEM_IN_ONE_TWO_THIRD_PAGE_TITLE    #language en-US  "Two selectable item in 1/3 and 2/3 page"
#string STR_FORM_SETUP_PAGE_PANEL_TWO_SELECTABLE_ITEM_IN_ONE_TWO_THIRD_PAGE_HELP     #language en-US  "There is two selectable item in first and second pages of 3 pages of setup page panel."
#string STR_FORM_SETUP_PAGE_PANEL_TWO_SELECTABLE_ITEM_IN_ONE_THREE_THIRD_PAGE_TITLE  #language en-US  "Two selectable item in 1/3 and 3/3 page"
#string STR_FORM_SETUP_PAGE_PANEL_TWO_SELECTABLE_ITEM_IN_ONE_THREE_THIRD_PAGE_HELP   #language en-US  "There is two selectable item in first and third page sof 3 pages of setup page panel."

// Test: Question with multi lines
#string STR_FORM_SETUP_PAGE_PANEL_NO_SELECTABLE_MULTI_LINE_ITEM_TITLE                #language en-US  "No selectable multi line item"
#string STR_FORM_SETUP_PAGE_PANEL_NO_SELECTABLE_MULTI_LINE_ITEM_HELP                 #language en-US  "There is no selectable item which occupy multi lines"
#string STR_FORM_SETUP_PAGE_PANEL_THREE_SELECTABLE_MULTI_LINE_ITEM_TITLE             #language en-US  "Three selectable multi line items"
#string STR_FORM_SETUP_PAGE_PANEL_THREE_SELECTABLE_MULTI_LINE_ITEM_HELP              #language en-US  "There is three selectable items which occupy multi lines"

#string STR_FORM_SETUP_PAGE_PANEL_HIGHLIGHT_TEST_TITLE                               #language en-US  "Highlight Test"
#string STR_FORM_SETUP_PAGE_PANEL_HIGHLIGHT_TEST_HELP                                #language en-US  "All questions in this form should be able to selected."

// Question text string
#string STR_QUESTION_TEXT_NUM_ONE                                                    #language en-US  "001"
#string STR_QUESTION_TEXT_NUM_TWO                                                    #language en-US  "002"
#string STR_QUESTION_TEXT_NUM_THREE                                                  #language en-US  "003"
#string STR_QUESTION_TEXT_NUM_FOUR                                                   #language en-US  "004"
#string STR_QUESTION_TEXT_NUM_FIVE                                                   #language en-US  "005"
#string STR_QUESTION_TEXT_NUM_SIX                                                    #language en-US  "006"
#string STR_QUESTION_TEXT_NUM_SEVEN                                                  #language en-US  "007"
#string STR_QUESTION_TEXT_NUM_EIGHT                                                  #language en-US  "008"
#string STR_QUESTION_TEXT_NUM_NINE                                                   #language en-US  "009"
#string STR_QUESTION_TEXT_NUM_TEN                                                    #language en-US  "010"
#string STR_QUESTION_TEXT_NUM_ELEVEN                                                 #language en-US  "011"
#string STR_QUESTION_TEXT_NUM_TWELVE                                                 #language en-US  "012"
#string STR_QUESTION_TEXT_NUM_THIRTEEN                                               #language en-US  "013"
#string STR_QUESTION_TEXT_NUM_FOURTEEN                                               #language en-US  "014"
#string STR_QUESTION_TEXT_NUM_FIFTEEN                                                #language en-US  "015"
#string STR_QUESTION_TEXT_NUM_SIXTEEN                                                #language en-US  "016"
#string STR_QUESTION_TEXT_NUM_SEVENTEEN                                              #language en-US  "017"
#string STR_QUESTION_TEXT_NUM_EIGHTEEN                                               #language en-US  "018"
#string STR_QUESTION_TEXT_NUM_NINETEEN                                               #language en-US  "019"
#string STR_QUESTION_TEXT_NUM_TWENTY                                                 #language en-US  "020"

#string STR_QUESTION_ONE_SAME_QUESTION_ID                                            #language en-US  "Goto question 1 with question ID 0x3002"
#string STR_QUESTION_TWO_SAME_QUESTION_ID                                            #language en-US  "Goto question 2 with question ID 0x3002"
#string STR_QUESTION_THREE_QUESTION_ID_ZERO                                          #language en-US  "Goto question 3 with question ID 0"

#string STR_QUESTION_TEXT_TWO_LINE                                                   #language en-US  "Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line"